<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

// return [
//     // 驱动方式
//     'type'   => 'File',
//     // 缓存保存目录
//     'path'   => '',
//     // 缓存前缀
//     'prefix' => '',
//     // 缓存有效期 0表示永久缓存
//     'expire' => 0,
// ];


// config/cache.php 配置示例：
return [
    // 使用Redis作为缓存驱动
    'type'     => 'redis',
    // 连接地址
    'host'     => '127.0.0.1',
    // 端口
    'port'     => 26739,
    // 密码（如果有的话）
    'password' => '',
    // 默认使用的 Redis 数据库索引
    'select'   => 0,
    // 全局缓存有效期（0表示永久有效）
    'expire'   => 0,
    // 是否长连接
    'persistent' => false,
    // 缓存前缀（根据需要设定，避免键冲突）
    'prefix'   => 'crm_in_',
];
